OdDAI.Enum.setTextValueCaseInsensitive(System.SByte!System.Runtime.CompilerServices.IsSignUnspecifiedByte!System.Runtime.CompilerServices.IsConst*)
\details
In case insensitive way assigns value for Enum instance by provided string.
\returns Returns true if provided string can be assigned to Enum instance and was successfully assigned, otherwise returns false.

OdDAI.Enum.setTextValue(System.SByte!System.Runtime.CompilerServices.IsSignUnspecifiedByte!System.Runtime.CompilerServices.IsConst*)
\details
Assigns value for Enum instance by provided string.
\returns Returns true if provided string can be assigned to Enum instance and was successfully assigned, otherwise returns false.

OdDAI.Enum.getTextValue
\details
Retrieves current enumeration value as string.
\returns Returns pointer to string that represents currently assigned enumeration value.

OdDAI.Enum.setIntValue(System.Int32)
\details
Assigns value for Enum instance by provided index.
\returns Returns true if provided index can be assigned to Enum instance and was successfully assigned, otherwise returns false.

OdDAI.Enum.getIntValue
\details
Retrieves the index of currently assigned enumeration value.
\returns Returns an integer index of currently assigned enumeration value.

OdDAI.Enum.getSchemaType
\details
Retrieves underlying enumeration type definition.
\returns Returns pointer to underlying EnumerationType object.

OdDAI.Enum.nullify
\details
Makes Enum instance unset.

OdDAI.Enum.exists
\details
Retrieves if Enum instance has assigned value.
\returns Returns true if Enum instance has assigned value; otherwise returns false.